#include<stdio.h>
int main()
{
	int i=5;
	/*int *const q = &i;
	printf("*q=%d\n", *q);
	*q = 25;
	printf("*q=%d\n", *q);*/
	//q++;因为int *const q相当于锁死了q的地址，可以操作地址里的数据，但是不能操作q；


	//=======================================================================================
	//	=====================================================================================


	//const int *m = &i;
	//*m = 25;因为const int*m相当于锁死了地址里的数，这种情况下可以操作地址，但是不能操作空间里的内容；
	//m++;
	//printf("*m=%d\n", *m);
	//printf("m=%p\n", p);

	int const *n = &i;
	//*n = 25;int const *n相当于const int *n，都是锁死了地址里的内容；
	*n++;
	return 0;

}